#1--------------------------------------------------------------------------
# 1. Создаем словарь
dct = {1: 'value_1', 2: 'value_2', 3: 'value_3'}
print(dct)
# 2. Добавляем в словарь новый элемент с ключом 'str_key' и значением 12345
dct['str_key']=12345
print(dct)
# 3. Добавляем в словарь новый элемент с ключом ('it', 'is', 'tuple') и значением [11, 22, 'list_value', 33, {1, 2, 3}]
dct[('it', 'is', 'tuple')]=[11, 22, 'list_value', 33, {1, 2, 3}]
print(dct)
# 4. Получаем элемент словаря по ключу 'str_key'
print(dct['str_key'])
# 5. Удаляем элемент с ключом '2' из словаря
dct.pop(2)
print(dct)
# 6. Получаем ключи словаря
print(dct.keys())
print(dct.values())
print(dct.items())

